app/controllers/extensions_controller.rb

  def index
    @extensions = Extension.all
---
SELECT "extensions".* FROM "extensions"

  def create
    @extension = Extension.new(extension_params)

    respond_to do |format|
      if @extension.save
---
INSERT INTO "extensions" ("extension", "name", "email", "department", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def set_extension
      @extension = Extension.find(params[:id])
---
SELECT  "extensions".* FROM "extensions" WHERE "extensions"."id" = ? LIMIT 1  [["id", 1]]