app/controllers/logged_controller.rb

  def index
  	@newsfeeds = Newsfeed.all
---
SELECT "newsfeeds".* FROM "newsfeeds"