app/controllers/newsfeeds_controller.rb

SELECT "newsfeeds".* FROM "newsfeeds"
---
  def index
    @newsfeeds = Newsfeed.all

INSERT INTO "newsfeeds" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "News 1"], ["body", "New Article for newsfeed"], ["user_id", 1], ["created_at", "2016-04-24 03:25:03.418176"], ["updated_at", "2016-04-24 03:25:03.418176"]]
---
  def create
    @newsfeed = current_user.newsfeeds.new(newsfeed_params)

    respond_to do |format|
      if @newsfeed.save

UPDATE "newsfeeds" SET "body" = ?, "updated_at" = ? WHERE "newsfeeds"."id" = ?  [["body", "This is to exemplify the newsfeed function"], ["updated_at", "2016-04-24 03:51:50.202085"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @newsfeed.update(newsfeed_params)

DELETE FROM "newsfeeds" WHERE "newsfeeds"."id" = ?  [["id", 1]]
---
  def destroy
    @newsfeed.destroy

SELECT  "newsfeeds".* FROM "newsfeeds" WHERE "newsfeeds"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_newsfeed
      @newsfeed = Newsfeed.find(params[:id])